'''
Определить, какое число в массиве встречается чаще всего.

'''

# import random
#
# SIZE_N = 10
# SIZE_M = 5
# MIN_ITEM = 0
# MAX_ITEM = 1000
# mass = [random.randint(MIN_ITEM, MAX_ITEM) for _ in range(SIZE_N)]
#
# mass = [30, 478, 689, 988, 775, 264, 832, 967, 1, 689, 988, 478, 689, 988, 775, 264, 832, 478, 689, 988, 775, 264, 832,
#         967, 1, 689, 988, 967, 1, 689, 988, 775, 264, 832, 967, 638, 318, 988, 775, 264, 832, 967, 638,
#         318, 1]
mass = [8, 3, 2, 7, 8, 3, 18, 9, 8, 8, 7, 7, 5, 8, 7, 6, 3, 8, 3, 18]
res = [0, 0]
print(mass)

for i in range(len(mass)):
    c = 0
    z = mass[i]
    for k in mass:
        if z == k:
            c += 1
        if c > res[1]:
            res[0] = z
            res[1] = c
if res[1] == 1:
    print('Все числа в списке встречаются по 1 разу')
else:
    print(f'Число {res[0]} встретилось {res[1]} раз')
